rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = '123'
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = '123'
---
  def similar
    id = params[:id]
    @match_field = params[:field]



    @similar = Movie.find(id)
    @director = @similar.director
    if @similar.director.nil? || @similar.director.empty?